#+TITLE: Maintenance ORG file for phenovisr package
#+AUTHOR: Lucas Mello Schnorr
#+STARTUP: overview indent
#+TAGS: noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

The package has been created with Rcpp's version of =package.skeleton=,
by running the following code. This is no longer necessary because the
package has already been created and modified.

#+begin_src R :results output :session :exports both
library(Rcpp);
Rcpp.package.skeleton("phenovisr");
#+end_src

Every time some new function is exported, we need to recompile the
attributes in the following way, so our R API gets updated.

#+begin_src R :results output :session :exports both
library(Rcpp);
compileAttributes(".");
#+end_src

#+RESULTS:

The package can be checked and installed the following way (for
development purposes only). Please note that the standard installation
procedure [[./README.org][has already been described in the README file]]. Note that the
following commands should be executed considering the existence of a
=phenovisr= directory with the contents of this repository. If you are
within the aforementioned directory, replace phenovisr by the dot.

#+begin_src shell :results output
#R CMD check .
R CMD INSTALL .
#+end_src

#+RESULTS:
: g++  -I/usr/share/R/include -DNDEBUG  -I"/home/schnorr/R/x86_64-pc-linux-gnu-library/3.4/Rcpp/include"    -fpic  -g -O2 -fdebug-prefix-map=/build/r-base-3.4.3=. -fstack-protector-strong -Wformat -Werror=format-security -Wdate-time -D_FORTIFY_SOURCE=2 -g  -c main.cpp -o main.o
: g++ -shared -L/usr/lib/R/lib -Wl,-z,relro -o phenovisr.so RcppExports.o histogram.o jpeg_image.o main.o metrics.o -ljpeg -L/usr/lib/R/lib -lR


